<template>
    <div class="flex flex-col items-center justify-center h-screen w-full ">
        <div class="absolute top-[75px] flex items-center justify-between w-[288px] h-[42px]">
            <button
                class="flex items-center justify-center  w-[42px] h-[42px] radius-[22px] gap-[10px] shadow-[0px_4px_12px_0px_#0D0A2C0F]">
                <svg width="26" height="26" viewBox="0 0 26 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M11.408 5.92548C11.7253 6.24278 11.7253 6.75722 11.408 7.07452L6.29504 12.1875H21.6668C22.1156 12.1875 22.4793 12.5513 22.4793 13C22.4793 13.4487 22.1156 13.8125 21.6668 13.8125H6.29504L11.408 18.9255C11.7253 19.2428 11.7253 19.7572 11.408 20.0745C11.0907 20.3918 10.5763 20.3918 10.259 20.0745L3.75897 13.5745C3.44167 13.2572 3.44167 12.7428 3.75897 12.4255L10.259 5.92548C10.5763 5.60817 11.0907 5.60817 11.408 5.92548Z"
                        fill="#0D1217" />
                </svg>
            </button>
            <div
                class="flex items-center justify-center w-[131px] h-[33px] text-[22px] leading-[33.26px] font-prompt text-[#0D1217]">
                ศูนย์ช่วยเหลือ
            </div>
            <div class="w-[42px] h-[42px] radius-[22px] gap-[10px] ">
            </div>
        </div>
        <div
            class="absolute top-[152px] flex items-center justify-between w-[288px] h-[56px] rounded-[8px] border-[1px] border-[#E9EAEB] px-[16px] gap-[12px] bg-[#1F2A370D]">
            <div class="flex items-center justify-center w-[24px] h-[24px]">
                <svg width="22" height="22" viewBox="0 0 22 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M10.5 1.75C5.66751 1.75 1.75 5.66751 1.75 10.5C1.75 15.3325 5.66751 19.25 10.5 19.25C15.3325 19.25 19.25 15.3325 19.25 10.5C19.25 5.66751 15.3325 1.75 10.5 1.75ZM0.25 10.5C0.25 4.83908 4.83908 0.25 10.5 0.25C16.1609 0.25 20.75 4.83908 20.75 10.5C20.75 13.0605 19.8111 15.4017 18.2589 17.1982L21.5303 20.4697C21.8232 20.7626 21.8232 21.2374 21.5303 21.5303C21.2374 21.8232 20.7626 21.8232 20.4697 21.5303L17.1982 18.2589C15.4017 19.8111 13.0605 20.75 10.5 20.75C4.83908 20.75 0.25 16.1609 0.25 10.5Z"
                        fill="#BABDC1" />
                </svg>
            </div>
            <input type="text"
                class="flex items-center justify-center bg-[#1F2A370D] h-[24px] w-[185px] opacity-30 font-prompt text-[16px] leading-[24.19px] text-[#0D1217]"
                placeholder="ค้นหา...">

            <div class="flex items-center justify-center w-[24px] h-[24px] rounded-[5px]">
                <svg width="22" height="18" viewBox="0 0 22 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M17.25 4C17.25 6.07107 15.5711 7.75 13.5 7.75C11.4289 7.75 9.75 6.07107 9.75 4C9.75 1.92893 11.4289 0.25 13.5 0.25C15.5711 0.25 17.25 1.92893 17.25 4ZM13.5 6.25C14.7426 6.25 15.75 5.24264 15.75 4C15.75 2.75736 14.7426 1.75 13.5 1.75C12.2574 1.75 11.25 2.75736 11.25 4C11.25 5.24264 12.2574 6.25 13.5 6.25Z"
                        fill="#0D1217" />
                    <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M4.75 14C4.75 16.0711 6.42893 17.75 8.5 17.75C10.5711 17.75 12.25 16.0711 12.25 14C12.25 11.9289 10.5711 10.25 8.5 10.25C6.42893 10.25 4.75 11.9289 4.75 14ZM8.5 16.25C7.25736 16.25 6.25 15.2426 6.25 14C6.25 12.7574 7.25736 11.75 8.5 11.75C9.74264 11.75 10.75 12.7574 10.75 14C10.75 15.2426 9.74264 16.25 8.5 16.25Z"
                        fill="#0D1217" />
                    <path
                        d="M13.25 13.9585C13.25 13.5443 13.5858 13.2085 14 13.2085H21C21.4142 13.2085 21.75 13.5443 21.75 13.9585C21.75 14.3727 21.4142 14.7085 21 14.7085H14C13.5858 14.7085 13.25 14.3727 13.25 13.9585Z"
                        fill="#0D1217" />
                    <path
                        d="M8 3.20852C8.41421 3.20852 8.75 3.54431 8.75 3.95852C8.75 4.37273 8.41421 4.70852 8 4.70852L1 4.70852C0.585786 4.70852 0.25 4.37273 0.25 3.95852C0.25 3.54431 0.585786 3.20852 1 3.20852L8 3.20852Z"
                        fill="#0D1217" />
                    <path
                        d="M0.25 13.9585C0.25 13.5443 0.585787 13.2085 1 13.2085H3C3.41421 13.2085 3.75 13.5443 3.75 13.9585C3.75 14.3727 3.41421 14.7085 3 14.7085H1C0.585787 14.7085 0.25 14.3727 0.25 13.9585Z"
                        fill="#0D1217" />
                    <path
                        d="M21 3.20852C21.4142 3.20852 21.75 3.54431 21.75 3.95852C21.75 4.37273 21.4142 4.70852 21 4.70852H19C18.5858 4.70852 18.25 4.37273 18.25 3.95852C18.25 3.54431 18.5858 3.20852 19 3.20852H21Z"
                        fill="#0D1217" />
                </svg>
            </div>
        </div>
        <div class="absolute top-[232px] overflow-x-auto scrollbar-hide w-[393px] h-[40px]">
            <div class="flex items-center gap-[8px] px-4 min-w-max">
                <button v-for="(item, index) in categories" :key="index" @click="toggleCategory(item)" :class="[
                    'flex items-center justify-center px-4 h-[40px] rounded-[8px] whitespace-nowrap transition-colors font-prompt text-[14px] gap-1',
                    selectedCategory === item
                        ? 'bg-gradient-custom text-white'
                        : 'hover:bg-gray-100 text-[#0D1217]'
                ]">
                    <svg v-if="selectedCategory === item" width="11" height="10" viewBox="0 0 11 10" fill="none"
                        xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd"
                            d="M10.4107 0.779186C10.6707 1.00619 10.6975 1.40102 10.4705 1.66104L3.92289 9.16104C3.8042 9.297 3.63254 9.37501 3.45206 9.37501C3.27159 9.37501 3.09993 9.297 2.98124 9.16104L0.362194 6.16104C0.135185 5.90102 0.161952 5.50619 0.421981 5.27919C0.682009 5.05218 1.07683 5.07894 1.30384 5.33897L3.45206 7.79967L9.52886 0.838973C9.75587 0.578944 10.1507 0.552177 10.4107 0.779186Z"
                            fill="white" />
                    </svg>
                    {{ item }}
                </button>
            </div>
        </div>
        <div class="absolute top-[296px] flex flex-col w-[288px] h-[611px] gap-[12px]">
            <button class="flex items-center justify-between w-[288px] h-[46px] rounded-[6px]"
                @click="openModal('ฉันจะสร้างบัญชีใหม่ได้อย่างไร?')">
                <div
                    class="flex items-center w-full text-left h-[48px] font-prompt text-[16px] leading-[24.19px] text-[#0D1217]">
                    ฉันจะสร้างบัญชีใหม่ได้อย่างไร?
                </div>
                <div class="flex items-center justify-center w-[24px] h-[24px]">
                    <svg width="8" height="16" viewBox="0 0 8 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd"
                            d="M0.51192 0.430571C0.826414 0.161005 1.29989 0.197426 1.56946 0.51192L7.56946 7.51192C7.8102 7.79279 7.8102 8.20724 7.56946 8.48811L1.56946 15.4881C1.29989 15.8026 0.826414 15.839 0.51192 15.5695C0.197426 15.2999 0.161005 14.8264 0.430571 14.5119L6.01221 8.00001L0.430571 1.48811C0.161005 1.17361 0.197426 0.700138 0.51192 0.430571Z"
                            fill="#0D1217" />
                    </svg>
                </div>
            </button>
            <button class="flex items-center justify-between w-[288px] h-[70px] rounded-[6px]">
                <div
                    class="flex items-center w-full text-left h-[48px] font-prompt text-[16px] leading-[24.19px] text-[#0D1217]">
                    ฉันลืมรหัสผ่าน ฉันจะรีเซ็ตรหัสผ่านได้อย่างไร
                </div>
                <div class="flex items-center justify-center w-[24px] h-[24px]">
                    <svg width="8" height="16" viewBox="0 0 8 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd"
                            d="M0.51192 0.430571C0.826414 0.161005 1.29989 0.197426 1.56946 0.51192L7.56946 7.51192C7.8102 7.79279 7.8102 8.20724 7.56946 8.48811L1.56946 15.4881C1.29989 15.8026 0.826414 15.839 0.51192 15.5695C0.197426 15.2999 0.161005 14.8264 0.430571 14.5119L6.01221 8.00001L0.430571 1.48811C0.161005 1.17361 0.197426 0.700138 0.51192 0.430571Z"
                            fill="#0D1217" />
                    </svg>
                </div>
            </button>
            <button class="flex items-center justify-between w-[288px] h-[70px] rounded-[6px]">
                <div
                    class="flex items-center w-full text-left h-[48px] font-prompt text-[16px] leading-[24.19px] text-[#0D1217]">
                    ฉันประสบปัญหาในการเข้าสู่ระบบบัญชีของฉัน ฉันจะแก้ไขปัญหานี้ได้อย่างไร
                </div>
                <div class="flex items-center justify-center w-[24px] h-[24px]">
                    <svg width="8" height="16" viewBox="0 0 8 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd"
                            d="M0.51192 0.430571C0.826414 0.161005 1.29989 0.197426 1.56946 0.51192L7.56946 7.51192C7.8102 7.79279 7.8102 8.20724 7.56946 8.48811L1.56946 15.4881C1.29989 15.8026 0.826414 15.839 0.51192 15.5695C0.197426 15.2999 0.161005 14.8264 0.430571 14.5119L6.01221 8.00001L0.430571 1.48811C0.161005 1.17361 0.197426 0.700138 0.51192 0.430571Z"
                            fill="#0D1217" />
                    </svg>
                </div>
            </button>
            <button class="flex items-center justify-between w-[288px] h-[46px] rounded-[6px]">
                <div
                    class="flex items-center w-full text-left h-[48px] font-prompt text-[16px] leading-[24.19px] text-[#0D1217]">
                    ฉันจะวางคำสั่งซื้อใหม่ได้อย่างไร?
                </div>
                <div class="flex items-center justify-center w-[24px] h-[24px]">
                    <svg width="8" height="16" viewBox="0 0 8 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd"
                            d="M0.51192 0.430571C0.826414 0.161005 1.29989 0.197426 1.56946 0.51192L7.56946 7.51192C7.8102 7.79279 7.8102 8.20724 7.56946 8.48811L1.56946 15.4881C1.29989 15.8026 0.826414 15.839 0.51192 15.5695C0.197426 15.2999 0.161005 14.8264 0.430571 14.5119L6.01221 8.00001L0.430571 1.48811C0.161005 1.17361 0.197426 0.700138 0.51192 0.430571Z"
                            fill="#0D1217" />
                    </svg>
                </div>
            </button>
            <button class="flex items-center justify-between w-[288px] h-[70px] rounded-[6px]">
                <div
                    class="flex items-center w-full text-left h-[48px] font-prompt text-[16px] leading-[24.19px] text-[#0D1217]">
                    ฉันกำลังประสบปัญหาเกี่ยวกับการชำระเงิน ฉันจะแก้ไขปัญหานี้ได้อย่างไร
                </div>
                <div class="flex items-center justify-center w-[24px] h-[24px]">
                    <svg width="8" height="16" viewBox="0 0 8 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd"
                            d="M0.51192 0.430571C0.826414 0.161005 1.29989 0.197426 1.56946 0.51192L7.56946 7.51192C7.8102 7.79279 7.8102 8.20724 7.56946 8.48811L1.56946 15.4881C1.29989 15.8026 0.826414 15.839 0.51192 15.5695C0.197426 15.2999 0.161005 14.8264 0.430571 14.5119L6.01221 8.00001L0.430571 1.48811C0.161005 1.17361 0.197426 0.700138 0.51192 0.430571Z"
                            fill="#0D1217" />
                    </svg>
                </div>
            </button>
            <button class="flex items-center justify-between w-[288px] h-[70px] rounded-[6px]">
                <div
                    class="flex items-center w-full text-left h-[48px] font-prompt text-[16px] leading-[24.19px] text-[#0D1217]">
                    ฉันต้องการยกเลิกคำสั่งซื้อที่ได้ทำไปจะต้องทำอย่างไร
                </div>
                <div class="flex items-center justify-center w-[24px] h-[24px]">
                    <svg width="8" height="16" viewBox="0 0 8 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd"
                            d="M0.51192 0.430571C0.826414 0.161005 1.29989 0.197426 1.56946 0.51192L7.56946 7.51192C7.8102 7.79279 7.8102 8.20724 7.56946 8.48811L1.56946 15.4881C1.29989 15.8026 0.826414 15.839 0.51192 15.5695C0.197426 15.2999 0.161005 14.8264 0.430571 14.5119L6.01221 8.00001L0.430571 1.48811C0.161005 1.17361 0.197426 0.700138 0.51192 0.430571Z"
                            fill="#0D1217" />
                    </svg>
                </div>
            </button>
            <button class="flex items-center justify-between w-[288px] h-[70px] rounded-[6px]">
                <div
                    class="flex items-center w-full text-left h-[48px] font-prompt text-[16px] leading-[24.19px] text-[#0D1217]">
                    ฉันสามารถหาข้อมูลรายละเอียดเกี่ยวกับผลิตภัณฑ์เฉพาะได้ที่ไหน
                </div>
                <div class="flex items-center justify-center w-[24px] h-[24px]">
                    <svg width="8" height="16" viewBox="0 0 8 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd"
                            d="M0.51192 0.430571C0.826414 0.161005 1.29989 0.197426 1.56946 0.51192L7.56946 7.51192C7.8102 7.79279 7.8102 8.20724 7.56946 8.48811L1.56946 15.4881C1.29989 15.8026 0.826414 15.839 0.51192 15.5695C0.197426 15.2999 0.161005 14.8264 0.430571 14.5119L6.01221 8.00001L0.430571 1.48811C0.161005 1.17361 0.197426 0.700138 0.51192 0.430571Z"
                            fill="#0D1217" />
                    </svg>
                </div>
            </button>
            <button class="flex items-center justify-between w-[288px] h-[70px] rounded-[6px]">
                <div
                    class="flex items-center w-full text-left h-[48px] font-prompt text-[16px] leading-[24.19px] text-[#0D1217]">
                    ฉันประสบปัญหาเกี่ยวกับผลิตภัณฑ์หรือ บริการ ฉันจะรายงานปัญหานี้ได้อย่างไร
                </div>
                <div class="flex items-center justify-center w-[24px] h-[24px]">
                    <svg width="8" height="16" viewBox="0 0 8 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd"
                            d="M0.51192 0.430571C0.826414 0.161005 1.29989 0.197426 1.56946 0.51192L7.56946 7.51192C7.8102 7.79279 7.8102 8.20724 7.56946 8.48811L1.56946 15.4881C1.29989 15.8026 0.826414 15.839 0.51192 15.5695C0.197426 15.2999 0.161005 14.8264 0.430571 14.5119L6.01221 8.00001L0.430571 1.48811C0.161005 1.17361 0.197426 0.700138 0.51192 0.430571Z"
                            fill="#0D1217" />
                    </svg>
                </div>
            </button>
            <div class="flex items-center justify-between w-[288px] h-[60px] rounded-[6px]"></div>
            <div class="flex items-center justify-between w-[288px] h-[60px] rounded-[6px]"></div>
        </div>
        <div class="fixed bottom-[50px] right-[20px] flex flex-col w-[46px] h-[104px] gap-[10px] z-[60]">
            <button
                class="flex items-center justify-center w-[46px] h-[46px] rounded-[22px] bg-gradient-custom shadow-[0px_4px_10px_0px_#0000001A] cursor-pointer">
                <div class="w-[30px] h-[30px]">
                    <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd"
                            d="M12.4295 4.0625H17.5705C19.8677 4.06248 21.6873 4.06246 23.1113 4.25392C24.5768 4.45095 25.763 4.8661 26.6984 5.80155C27.6339 6.73701 28.049 7.92319 28.2461 9.38872C28.4375 10.8127 28.4375 12.6323 28.4375 14.9295V15.0705C28.4375 17.3677 28.4375 19.1873 28.2461 20.6113C28.049 22.0768 27.6339 23.263 26.6984 24.1984C25.763 25.1339 24.5768 25.549 23.1113 25.7461C21.6873 25.9375 19.8677 25.9375 17.5705 25.9375H12.4295C10.1323 25.9375 8.31274 25.9375 6.88872 25.7461C5.42319 25.549 4.23701 25.1339 3.30155 24.1984C2.3661 23.263 1.95095 22.0768 1.75392 20.6113C1.56246 19.1873 1.56248 17.3677 1.5625 15.0705V14.9295C1.56248 12.6323 1.56246 10.8127 1.75392 9.38872C1.95095 7.92319 2.3661 6.73701 3.30155 5.80155C4.23701 4.8661 5.42319 4.45095 6.88872 4.25392C8.31274 4.06246 10.1323 4.06248 12.4295 4.0625ZM7.13856 6.1122C5.88095 6.28128 5.15639 6.59837 4.62738 7.12738C4.09837 7.65639 3.78128 8.38095 3.6122 9.63856C3.43949 10.9231 3.4375 12.6165 3.4375 15C3.4375 17.3835 3.43949 19.0769 3.6122 20.3614C3.78128 21.6191 4.09837 22.3436 4.62738 22.8726C5.15639 23.4016 5.88095 23.7187 7.13856 23.8878C8.42314 24.0605 10.1165 24.0625 12.5 24.0625H17.5C19.8835 24.0625 21.5769 24.0605 22.8614 23.8878C24.1191 23.7187 24.8436 23.4016 25.3726 22.8726C25.9016 22.3436 26.2187 21.6191 26.3878 20.3614C26.5605 19.0769 26.5625 17.3835 26.5625 15C26.5625 12.6165 26.5605 10.9231 26.3878 9.63856C26.2187 8.38095 25.9016 7.65639 25.3726 7.12738C24.8436 6.59837 24.1191 6.28128 22.8614 6.1122C21.5769 5.93949 19.8835 5.9375 17.5 5.9375H12.5C10.1165 5.9375 8.42314 5.93949 7.13856 6.1122ZM6.77979 9.39983C7.11126 9.00207 7.70241 8.94833 8.10017 9.27979L10.7988 11.5286C11.965 12.5005 12.7747 13.173 13.4582 13.6127C14.1199 14.0382 14.5687 14.1811 15 14.1811C15.4313 14.1811 15.8801 14.0382 16.5418 13.6127C17.2253 13.173 18.035 12.5005 19.2012 11.5286L21.8998 9.27979C22.2976 8.94833 22.8887 9.00207 23.2202 9.39983C23.5517 9.79759 23.4979 10.3887 23.1002 10.7202L20.3546 13.0082C19.2466 13.9315 18.3486 14.6799 17.556 15.1897C16.7304 15.7207 15.9263 16.0561 15 16.0561C14.0737 16.0561 13.2696 15.7207 12.444 15.1897C11.6514 14.6799 10.7534 13.9315 9.64545 13.0082L6.89983 10.7202C6.50207 10.3887 6.44833 9.79759 6.77979 9.39983Z"
                            fill="white" />
                    </svg>
                </div>
            </button>
            <button
                class="flex items-center justify-center w-[46px] h-[46px] rounded-[22px] bg-gradient-custom shadow-[0px_4px_10px_0px_#0000001A] cursor-pointer">
                <div class="w-[30px] h-[30px]">
                    <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd"
                            d="M5.89712 3.86512C7.42985 2.25145 9.96512 2.55378 11.2321 4.34575L12.8083 6.57511C13.8218 8.00844 13.7362 10.0012 12.5267 11.2745L12.2206 11.5967C12.2198 11.599 12.2189 11.6014 12.2179 11.604C12.2018 11.6494 12.1609 11.7942 12.2011 12.0688C12.2846 12.6383 12.7241 13.7954 14.5087 15.6742C16.2989 17.5589 17.3847 18.0031 17.8879 18.0848C18.105 18.1201 18.2185 18.0895 18.2547 18.0767L18.7655 17.5389C19.8577 16.3891 21.5607 16.1625 22.9338 16.9528L25.3219 18.3274C27.363 19.5023 27.8381 22.3763 26.2069 24.0936L24.4312 25.9631C23.877 26.5466 23.1213 27.0446 22.1875 27.1368C19.9076 27.3618 14.6262 27.0687 9.08951 21.2396C3.92305 15.8003 2.94158 11.0692 2.81751 8.75763L3.65013 8.71294L2.81751 8.75763C2.75621 7.61554 3.26531 6.63593 3.93512 5.93074L5.89712 3.86512ZM9.70113 5.42821C9.06069 4.5224 7.91014 4.46835 7.2566 5.15641L5.2946 7.22203C4.88036 7.65814 4.66302 8.15801 4.68981 8.65714C4.79111 10.5444 5.60383 14.8473 10.449 19.9483C15.5292 25.2968 20.2095 25.4479 22.0033 25.2709C22.358 25.2359 22.7229 25.039 23.0717 24.6718L24.8474 22.8024C25.6134 21.9959 25.4126 20.5431 24.3865 19.9525L21.9984 18.5779C21.3575 18.209 20.6068 18.323 20.125 18.8302L19.5557 19.4296L18.8967 18.8037C19.5557 19.4296 19.5548 19.4305 19.5539 19.4314L19.5522 19.4333L19.5485 19.4371L19.5405 19.4452L19.5226 19.4629C19.5097 19.4753 19.4949 19.489 19.4781 19.5038C19.4445 19.5332 19.4029 19.5668 19.3529 19.6023C19.2528 19.6733 19.1194 19.7514 18.9508 19.8179C18.6058 19.954 18.1502 20.027 17.5873 19.9356C16.4904 19.7575 15.0528 18.9696 13.1492 16.9655C11.24 14.9555 10.5093 13.4558 10.3459 12.3407C10.2628 11.7731 10.3293 11.3186 10.4515 10.9754C10.5115 10.8066 10.5824 10.672 10.6478 10.5698C10.6804 10.5189 10.7115 10.4762 10.739 10.4415C10.7527 10.4241 10.7656 10.4087 10.7773 10.3953L10.7939 10.3765L10.8016 10.3683L10.8052 10.3644L10.807 10.3625C10.8078 10.3616 10.8087 10.3607 11.4733 10.9919L10.8087 10.3607L11.1672 9.98321C11.7241 9.39688 11.805 8.4039 11.2774 7.65757L9.70113 5.42821Z"
                            fill="white" />
                        <path
                            d="M16.5744 2.34979C16.6571 1.83868 17.1403 1.49196 17.6514 1.57471C17.683 1.58076 17.7848 1.59979 17.8382 1.61167C17.9448 1.63542 18.0936 1.67199 18.2791 1.72602C18.6501 1.83408 19.1683 2.01208 19.7904 2.29725C21.0357 2.8682 22.693 3.86695 24.4127 5.5867C26.1325 7.30645 27.1312 8.96372 27.7022 10.2091C27.9873 10.8311 28.1653 11.3493 28.2734 11.7203C28.3274 11.9058 28.364 12.0546 28.3878 12.1613C28.3996 12.2146 28.4083 12.2574 28.4144 12.2891L28.4216 12.3281C28.5043 12.8392 28.1607 13.3423 27.6496 13.4251C27.14 13.5076 26.6599 13.1625 26.5751 12.6538C26.5725 12.6402 26.5653 12.6035 26.5576 12.5689C26.5422 12.4996 26.5155 12.3898 26.4732 12.2447C26.3886 11.9542 26.2417 11.5226 25.9978 10.9905C25.5105 9.92759 24.6342 8.45986 23.0869 6.91253C21.5396 5.3652 20.0718 4.48896 19.009 4.00167C18.4769 3.75772 18.0452 3.61081 17.7548 3.52622C17.6096 3.48393 17.4271 3.44204 17.3579 3.42662C16.8491 3.34184 16.4918 2.85944 16.5744 2.34979Z"
                            fill="white" />
                        <path fill-rule="evenodd" clip-rule="evenodd"
                            d="M16.8576 6.66164C16.9998 6.16379 17.5187 5.87552 18.0166 6.01776L17.759 6.91919C18.0166 6.01776 18.017 6.01788 18.0175 6.01801L18.0184 6.01827L18.0203 6.01883L18.0245 6.02004L18.0342 6.02294L18.0589 6.03064C18.0777 6.03667 18.1013 6.04452 18.1293 6.05448C18.1855 6.0744 18.2597 6.10273 18.3507 6.14173C18.5328 6.21978 18.7816 6.3403 19.0873 6.52119C19.6991 6.8833 20.5343 7.48477 21.5155 8.46598C22.4967 9.4472 23.0982 10.2824 23.4603 10.8943C23.6412 11.1999 23.7617 11.4487 23.8398 11.6308C23.8788 11.7218 23.9071 11.796 23.927 11.8522C23.937 11.8802 23.9448 11.9038 23.9509 11.9226L23.9586 11.9474L23.9615 11.9571L23.9627 11.9612L23.9632 11.9631L23.9635 11.964C23.9636 11.9645 23.9638 11.9649 23.0623 12.2225L23.9638 11.9649C24.106 12.4628 23.8177 12.9817 23.3199 13.1239C22.8263 13.2649 22.312 12.9827 22.1646 12.4927L22.16 12.4792C22.1533 12.4604 22.1395 12.4234 22.1164 12.3694C22.0701 12.2615 21.9863 12.085 21.8467 11.8492C21.568 11.3783 21.0647 10.6667 20.1897 9.79181C19.3148 8.91687 18.6032 8.41349 18.1323 8.13477C17.8965 7.99525 17.72 7.91138 17.6121 7.86513C17.5581 7.84199 17.5211 7.82819 17.5023 7.82153L17.4888 7.81691C16.9988 7.66956 16.7166 7.15525 16.8576 6.66164Z"
                            fill="white" />
                    </svg>
                </div>
            </button>
        </div>
        <dialog id="my_modal" class="modal">
            <div class="modal-box w-full h-full top-[54px] rounded-[12px]">
                <div class="flex flex-col">
                    <h3 class="text-lg font-prompt font-bold">{{ selectedQuestion }}</h3>
                    <p class="py-4 font-prompt whitespace-pre-line">{{ selectedAnswer }}</p>
                    <div class="flex flex-col items-center gap-4 mt-6">
                        <div class="flex gap-4">
                            <button
                                class="flex items-center justify-center w-[46px] h-[46px] rounded-[22px] bg-gradient-custom shadow-[0px_4px_10px_0px_#0000001A]">
                                <div class="w-[30px] h-[30px]">
                                    <svg width="30" height="30" viewBox="0 0 30 30" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                        <path fill-rule="evenodd" clip-rule="evenodd"
                                            d="M12.4295 4.0625H17.5705C19.8677 4.06248 21.6873 4.06246 23.1113 4.25392C24.5768 4.45095 25.763 4.8661 26.6984 5.80155C27.6339 6.73701 28.049 7.92319 28.2461 9.38872C28.4375 10.8127 28.4375 12.6323 28.4375 14.9295V15.0705C28.4375 17.3677 28.4375 19.1873 28.2461 20.6113C28.049 22.0768 27.6339 23.263 26.6984 24.1984C25.763 25.1339 24.5768 25.549 23.1113 25.7461C21.6873 25.9375 19.8677 25.9375 17.5705 25.9375H12.4295C10.1323 25.9375 8.31274 25.9375 6.88872 25.7461C5.42319 25.549 4.23701 25.1339 3.30155 24.1984C2.3661 23.263 1.95095 22.0768 1.75392 20.6113C1.56246 19.1873 1.56248 17.3677 1.5625 15.0705V14.9295C1.56248 12.6323 1.56246 10.8127 1.75392 9.38872C1.95095 7.92319 2.3661 6.73701 3.30155 5.80155C4.23701 4.8661 5.42319 4.45095 6.88872 4.25392C8.31274 4.06246 10.1323 4.06248 12.4295 4.0625ZM7.13856 6.1122C5.88095 6.28128 5.15639 6.59837 4.62738 7.12738C4.09837 7.65639 3.78128 8.38095 3.6122 9.63856C3.43949 10.9231 3.4375 12.6165 3.4375 15C3.4375 17.3835 3.43949 19.0769 3.6122 20.3614C3.78128 21.6191 4.09837 22.3436 4.62738 22.8726C5.15639 23.4016 5.88095 23.7187 7.13856 23.8878C8.42314 24.0605 10.1165 24.0625 12.5 24.0625H17.5C19.8835 24.0625 21.5769 24.0605 22.8614 23.8878C24.1191 23.7187 24.8436 23.4016 25.3726 22.8726C25.9016 22.3436 26.2187 21.6191 26.3878 20.3614C26.5605 19.0769 26.5625 17.3835 26.5625 15C26.5625 12.6165 26.5605 10.9231 26.3878 9.63856C26.2187 8.38095 25.9016 7.65639 25.3726 7.12738C24.8436 6.59837 24.1191 6.28128 22.8614 6.1122C21.5769 5.93949 19.8835 5.9375 17.5 5.9375H12.5C10.1165 5.9375 8.42314 5.93949 7.13856 6.1122ZM6.77979 9.39983C7.11126 9.00207 7.70241 8.94833 8.10017 9.27979L10.7988 11.5286C11.965 12.5005 12.7747 13.173 13.4582 13.6127C14.1199 14.0382 14.5687 14.1811 15 14.1811C15.4313 14.1811 15.8801 14.0382 16.5418 13.6127C17.2253 13.173 18.035 12.5005 19.2012 11.5286L21.8998 9.27979C22.2976 8.94833 22.8887 9.00207 23.2202 9.39983C23.5517 9.79759 23.4979 10.3887 23.1002 10.7202L20.3546 13.0082C19.2466 13.9315 18.3486 14.6799 17.556 15.1897C16.7304 15.7207 15.9263 16.0561 15 16.0561C14.0737 16.0561 13.2696 15.7207 12.444 15.1897C11.6514 14.6799 10.7534 13.9315 9.64545 13.0082L6.89983 10.7202C6.50207 10.3887 6.44833 9.79759 6.77979 9.39983Z"
                                            fill="white" />
                                    </svg>
                                </div>
                            </button>
                            <button
                                class="flex items-center justify-center w-[46px] h-[46px] rounded-[22px] bg-gradient-custom shadow-[0px_4px_10px_0px_#0000001A]">
                                <svg width="30" height="30" viewBox="0 0 30 30" fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd"
                                        d="M5.89712 3.86512C7.42985 2.25145 9.96512 2.55378 11.2321 4.34575L12.8083 6.57511C13.8218 8.00844 13.7362 10.0012 12.5267 11.2745L12.2206 11.5967C12.2198 11.599 12.2189 11.6014 12.2179 11.604C12.2018 11.6494 12.1609 11.7942 12.2011 12.0688C12.2846 12.6383 12.7241 13.7954 14.5087 15.6742C16.2989 17.5589 17.3847 18.0031 17.8879 18.0848C18.105 18.1201 18.2185 18.0895 18.2547 18.0767L18.7655 17.5389C19.8577 16.3891 21.5607 16.1625 22.9338 16.9528L25.3219 18.3274C27.363 19.5023 27.8381 22.3763 26.2069 24.0936L24.4312 25.9631C23.877 26.5466 23.1213 27.0446 22.1875 27.1368C19.9076 27.3618 14.6262 27.0687 9.08951 21.2396C3.92305 15.8003 2.94158 11.0692 2.81751 8.75763L3.65013 8.71294L2.81751 8.75763C2.75621 7.61554 3.26531 6.63593 3.93512 5.93074L5.89712 3.86512ZM9.70113 5.42821C9.06069 4.5224 7.91014 4.46835 7.2566 5.15641L5.2946 7.22203C4.88036 7.65814 4.66302 8.15801 4.68981 8.65714C4.79111 10.5444 5.60383 14.8473 10.449 19.9483C15.5292 25.2968 20.2095 25.4479 22.0033 25.2709C22.358 25.2359 22.7229 25.039 23.0717 24.6718L24.8474 22.8024C25.6134 21.9959 25.4126 20.5431 24.3865 19.9525L21.9984 18.5779C21.3575 18.209 20.6068 18.323 20.125 18.8302L19.5557 19.4296L18.8967 18.8037C19.5557 19.4296 19.5548 19.4305 19.5539 19.4314L19.5522 19.4333L19.5485 19.4371L19.5405 19.4452L19.5226 19.4629C19.5097 19.4753 19.4949 19.489 19.4781 19.5038C19.4445 19.5332 19.4029 19.5668 19.3529 19.6023C19.2528 19.6733 19.1194 19.7514 18.9508 19.8179C18.6058 19.954 18.1502 20.027 17.5873 19.9356C16.4904 19.7575 15.0528 18.9696 13.1492 16.9655C11.24 14.9555 10.5093 13.4558 10.3459 12.3407C10.2628 11.7731 10.3293 11.3186 10.4515 10.9754C10.5115 10.8066 10.5824 10.672 10.6478 10.5698C10.6804 10.5189 10.7115 10.4762 10.739 10.4415C10.7527 10.4241 10.7656 10.4087 10.7773 10.3953L10.7939 10.3765L10.8016 10.3683L10.8052 10.3644L10.807 10.3625C10.8078 10.3616 10.8087 10.3607 11.4733 10.9919L10.8087 10.3607L11.1672 9.98321C11.7241 9.39688 11.805 8.4039 11.2774 7.65757L9.70113 5.42821Z"
                                        fill="white" />
                                    <path
                                        d="M16.5744 2.34979C16.6571 1.83868 17.1403 1.49196 17.6514 1.57471C17.683 1.58076 17.7848 1.59979 17.8382 1.61167C17.9448 1.63542 18.0936 1.67199 18.2791 1.72602C18.6501 1.83408 19.1683 2.01208 19.7904 2.29725C21.0357 2.8682 22.693 3.86695 24.4127 5.5867C26.1325 7.30645 27.1312 8.96372 27.7022 10.2091C27.9873 10.8311 28.1653 11.3493 28.2734 11.7203C28.3274 11.9058 28.364 12.0546 28.3878 12.1613C28.3996 12.2146 28.4083 12.2574 28.4144 12.2891L28.4216 12.3281C28.5043 12.8392 28.1607 13.3423 27.6496 13.4251C27.14 13.5076 26.6599 13.1625 26.5751 12.6538C26.5725 12.6402 26.5653 12.6035 26.5576 12.5689C26.5422 12.4996 26.5155 12.3898 26.4732 12.2447C26.3886 11.9542 26.2417 11.5226 25.9978 10.9905C25.5105 9.92759 24.6342 8.45986 23.0869 6.91253C21.5396 5.3652 20.0718 4.48896 19.009 4.00167C18.4769 3.75772 18.0452 3.61081 17.7548 3.52622C17.6096 3.48393 17.4271 3.44204 17.3579 3.42662C16.8491 3.34184 16.4918 2.85944 16.5744 2.34979Z"
                                        fill="white" />
                                    <path fill-rule="evenodd" clip-rule="evenodd"
                                        d="M16.8576 6.66164C16.9998 6.16379 17.5187 5.87552 18.0166 6.01776L17.759 6.91919C18.0166 6.01776 18.017 6.01788 18.0175 6.01801L18.0184 6.01827L18.0203 6.01883L18.0245 6.02004L18.0342 6.02294L18.0589 6.03064C18.0777 6.03667 18.1013 6.04452 18.1293 6.05448C18.1855 6.0744 18.2597 6.10273 18.3507 6.14173C18.5328 6.21978 18.7816 6.3403 19.0873 6.52119C19.6991 6.8833 20.5343 7.48477 21.5155 8.46598C22.4967 9.4472 23.0982 10.2824 23.4603 10.8943C23.6412 11.1999 23.7617 11.4487 23.8398 11.6308C23.8788 11.7218 23.9071 11.796 23.927 11.8522C23.937 11.8802 23.9448 11.9038 23.9509 11.9226L23.9586 11.9474L23.9615 11.9571L23.9627 11.9612L23.9632 11.9631L23.9635 11.964C23.9636 11.9645 23.9638 11.9649 23.0623 12.2225L23.9638 11.9649C24.106 12.4628 23.8177 12.9817 23.3199 13.1239C22.8263 13.2649 22.312 12.9827 22.1646 12.4927L22.16 12.4792C22.1533 12.4604 22.1395 12.4234 22.1164 12.3694C22.0701 12.2615 21.9863 12.085 21.8467 11.8492C21.568 11.3783 21.0647 10.6667 20.1897 9.79181C19.3148 8.91687 18.6032 8.41349 18.1323 8.13477C17.8965 7.99525 17.72 7.91138 17.6121 7.86513C17.5581 7.84199 17.5211 7.82819 17.5023 7.82153L17.4888 7.81691C16.9988 7.66956 16.7166 7.15525 16.8576 6.66164Z"
                                        fill="white" />
                                </svg>
                            </button>
                        </div>
                    </div>
                </div>
            </div>
            <form method="dialog" class="modal-backdrop">
                <button>close</button>
            </form>
        </dialog>
    </div>
</template>

<style scoped>
.font-prompt {
    font-family: 'Prompt';
}

.bg-gradient-custom {
    background: linear-gradient(121.94deg, #FF6347 0%, #FF826C 100%);
}

.text-gradient-custom {
    background: linear-gradient(121.94deg, #FF6347 0%, #FF826C 100%);
    -webkit-background-clip: text;
    background-clip: text;
    color: transparent;
}

/* Add these CSS classes to hide scrollbar */
.scrollbar-hide::-webkit-scrollbar {
    display: none;
}

.scrollbar-hide {
    -ms-overflow-style: none;
    /* IE and Edge */
    scrollbar-width: none;
    /* Firefox */
}

/* Add these transition classes */
.slide-enter-active,
.slide-leave-active {
    transition: transform 0.3s ease-out;
}

.slide-enter-from {
    transform: translateY(100%);
}

.slide-leave-to {
    transform: translateY(100%);
}

.fade-enter-active,
.fade-leave-active {
    transition: opacity 0.3s ease;
}

.fade-enter-from,
.fade-leave-to {
    opacity: 0;
}

.whitespace-pre-line {
    white-space: pre-line;
}

.leading-relaxed {
    line-height: 1.75;
}

.slide-enter-active,
.slide-leave-active {
    transition: transform 0.3s ease-out;
}

.slide-enter-from {
    transform: translateY(100%);
}

.slide-leave-to {
    transform: translateY(100%);
}

/* Add smooth scrolling to modal */
.modal-content {
    scroll-behavior: smooth;
}
</style>

<script setup>
import { ref } from 'vue';
import Promotion from '~/components/user/Promotion.vue'
import PromotionSlide from '~/components/user/PromotionSlide.vue'
import userLayouts from '~/layouts/userLayouts.vue';

const isModalOpen = ref(false);
const categories = [
    'ทั่วไป',
    'บัญชีผู้ใช้',
    'การสั่งซื้อ',
    'การชำระเงิน',
    'การจัดส่ง',
    'สินค้า',
    'โปรโมชั่น',
    'การคืนสินค้า',
    'อื่นๆ'
];
const selectedCategory = ref(null); // Changed default to null

const toggleCategory = (category) => {
    selectedCategory.value = selectedCategory.value === category ? null : category;
};

const showModal = ref(false);
const selectedQuestion = ref('');
const selectedAnswer = ref('');

// Sample QA data
const qaData = {
    'ฉันจะสร้างบัญชีใหม่ได้อย่างไร?': `หากต้องการสร้างบัญชีใหม่ โปรดปฏิบัติตามขั้นตอนง่ายๆ เหล่านี้:

1. เปิดแอปและไปที่หน้าจอเข้าสู่ระบบ

2. ใต้แบบฟอร์มการเข้าสู่ระบบ คุณจะเห็นตัวเลือก "ลงทะเบียน" แตะที่ตัวเลือกนั้น

3. ระบบจะขอให้คุณป้อนหมายเลขโทรศัพท์ อีเมลและชื่อนามสกุลสำหรับบัญชีของคุณ โปรดใช้หมายเลขโทรศัพท์ที่ถูกต้อง

4. หลังจากป้อนหมายเลขโทรศัพท์ อีเมล และชื่อ-นามสกุลของคุณแล้ว ให้แตะที่ปุ่ม "ลงทะเบียน"

5. รหัสจะถูกส่งไปยังหมายเลขโทรศัพท์ที่คุณให้ไว้เพื่อยืนยัน โปรดตรวจสอบกล่องจดหมายของคุณ และป้อนรหัสในหน้าจอยืนยันเพื่อยืนยันบัญชีของคุณ

6. เมื่อบัญชีของคุณได้รับการยืนยันแล้ว แอปจะเข้าสู่ระบบให้คุณโดยอัตโนมัติ

7. คุณสามารถกรอกข้อมูลส่วนตัวอื่นๆ หรือข้ามก็ได้

8. คุณสามารถตั้งค่าระดับความปลอดภัยที่จําเป็นสําหรับบัญชีของคุณหรือละเว้นก็ได้

9. ตอนนี้คุณสร้างบัญชีของคุณเสร็จเรียบร้อยแล้ว

หากคุณประสบปัญหาใดๆ ในระหว่างขั้นตอนการสมัคร โปรดติดต่อทีมสนับสนุนของเราเพื่อขอความช่วยเหลือ`,
    'ฉันลืมรหัสผ่าน ฉันจะรีเซ็ตรหัสผ่านได้อย่างไร': 'การรีเซ็ตรหัสผ่านสามารถทำได้โดย...',
};

const openModal = (question) => {
    selectedQuestion.value = question;
    selectedAnswer.value = qaData[question];
    const modal = document.getElementById('my_modal');
    modal.showModal();
};

const closeModal = () => {
    showModal.value = false;
};
</script>